'''
Здесь должна быть реализация генератора ключа
'''
# Пример полученного ключа
K = 0xffeeddccbbaa99887766554433221100f0f1f2f3f4f5f6f7f8f9fafbfcfdfeff # Ключ 256-бит


# MASK32 нужен, если требуется получить 32 бита числа
MASK32 = 2 ** 32 - 1 # в двоичном виде это 32 единицы

# Функция t
# S-box
'''
    S-box - это таблица замен.
    Он заменяет входящие биты на набор других битов по заданным правилам
    хуй
    В данном случае S-box-ом является pi, а правила задает функция t
'''
# Переписал это в виде 16-ных чисел, чтобы потом было легче на Verilog заполнять
pi0 = [0xc, 0x4, 0x6, 0x2, 0xa, 0x5, 0xb, 0x9, 0xe, 0x8, 0xd, 0x7, 0x0, 0x3, 0xf, 0x1]
pi1 = [0x6, 0x8, 0x2, 0x3, 0x9, 0xa, 0x5, 0xc, 0x1, 0xe, 0x4, 0x7, 0xb, 0xd, 0x0, 0xf]
pi2 = [0xb, 0x3, 0x5, 0x8, 0x2, 0xf, 0xa, 0xd, 0xe, 0x1, 0x7, 0x4, 0xc, 0x9, 0x6, 0x0]
pi3 = [0xc, 0x8, 0x2, 0x1, 0xd, 0x4, 0xf, 0x6, 0x7, 0x0, 0xa, 0x5, 0x3, 0xe, 0x9, 0xb]
pi4 = [0x7, 0xf, 0x5, 0xa, 0x8, 0x1, 0x6, 0xd, 0x0, 0x9, 0x3, 0xe, 0xb, 0x4, 0x2, 0xc]
pi5 = [0x5, 0xd, 0xf, 0x6, 0x9, 0x2, 0xc, 0xa, 0xb, 0x7, 0x8, 0x1, 0x4, 0x3, 0xe, 0x0]
pi6 = [0x8, 0xe, 0x2, 0x5, 0x6, 0x9, 0x1, 0xc, 0xf, 0x4, 0xb, 0x0, 0xd, 0xa, 0x3, 0x7]
pi7 = [0x1, 0x7, 0xe, 0xd, 0x0, 0x5, 0x8, 0x3, 0x4, 0xf, 0xa, 0x6, 0x9, 0xc, 0xb, 0x2]
pi  = [pi0, pi1, pi2, pi3, pi4, pi5, pi6, pi7]



# x - входящее значение,     32 бита
# y - возвращаемое значение, 32 бита
'''
Как работает ф-ция t:
    1) На вход подается 32-битное значение (x), оно разбивается на
    8 частей по 4 бита  

    2) Далее в цикле, который повторяется 8 раз, берем первые 
    4 бита из входящего x и записываем в j. Далее берем следующие 
    за этими 4 битами, и т.д.
    2.1) Индекс i указывает на используемый блок pi0..pi7

    3) Далее сдвигаем полученный результат (y) вправо на 4 бита, 
    чтобы дальше накапливать результат

    4) Далее с полученным и сдвинутым результатом проводим операцию 
    XOR вместе с j-тым значением i-ого блока pi
    5) после 8 итераций замены возвращается результат
    
'''
def t(x):
    y = 0
    # от 7 до 0
    for i in range(7, -1, -1):
        j = (x >> 4 * i) & 0xf # берем первые 4 бита из x
        y = y << 4
        y = y ^ pi[i][j]
    return y


# Вспомогательная ф-ция
# На Verilog проще реализуется
# Циклический сдвиг влево
def cycle_shift_11(x):
    return ((x << 11) ^ (x >> (32 - 11))) & MASK32


# Ф-ция g
'''
Как работает Ф-ция g:
    x - входное значение;
    k - ключ.
    1) Складываем x + k по модулю 32 (кольцо вычетов по модулю 2^32)
    2) помещаем результат в функцию t
    3) циклически сдвигаем на 11 битов влево

    это функция Фейстеля
'''

def g(x, k):
    return cycle_shift_11( t( (x + k) % (2**32) ) )

'''
    Расписываем теперь все ключи, которые необходимы для функции g
    Как они берутся:
    1-8)   Первые 8 ключей получены из общего ключа, его делим на 8 частей по 32 бита
    9-16)  Следующие 8 ключей это повторение предыдущих ключей
    17-24) Следующие 8 ключей это повторение предыдущих ключей
    25-32) Последние 8 ключей - это те же самые ключи 1-8, но в обратном порядке
'''

'''
k - 256-битный ключ.
keys - возвращаемое значение, хранящее 32 ключа по 32 бита каждый.
'''

def key_schedule(k):
    keys = [] # получаемые ключи
    # 1-8 ключи
    for i in range(7, -1, -1):
        keys.append((k >> (32 * i)) & MASK32)
    # 9-16 ключи
    for i in range(8):
        keys.append(keys[i])
    # 17-24 ключи
    for i in range(8):
        keys.append(keys[i])    
    # 25-32 ключи
    for i in range(7, -1, -1):
        keys.append(keys[i])
    return keys


# Вспомогательные функции
'''
Т.к. Шифр основан на сети Фейстеля, где шифруемое значение
разбивается на две части - левая и правая,
Поэтому надо разбить входное 64-битное значение на два 32-битных значения.
Это делает функция split
'''
def split(x):
    L = x >> 32
    R = x & MASK32
    return (L, R)

# также сделаем функцию объединения
def join(L, R):
    return (L << 32) ^ R

# Ф-ция G (для шифрования)
# k - это ключи, полученные в ф-ции key_schedule (32 ключа по 32 бита)
# a1 - это L, левая 32-битная часть 64-битного вычисляемого значения
# a0 - это R, правая 32-битная часть 64-битного вычисляемого значения
# в раундах 1-31 правую часть записываем влево, а правую часть изменяем (). А потом меняем наоборот и т.д.
# в последнем 32 раунде просто изменяем левую часть, но записываем левую в левую часть, а правую в правую
def G(a1, a0, k):
    return (a0, g(a0, k) ^ a1)

# Ф-ция зашифрования
# x - 64-битное выражение, которое необходимо зашифровать
# k - 256-битный ключ

def encrypt(x, k):
    key = key_schedule(k)                # получаем 32-битные ключи
    (L, R) = split(x)                    # разбиваем шифруемое выражение на две части
    for i in range(31):
        (L, R) = G(L, R, key[i])         # 31 раунд шифрации с помощью функции G
    (R, L) = G(L, R, key[31])            # Делаем последний 32 раунд, но записываем результат наоборот
    return join(L, R)


# Ф-ция G* (для дешифрования)
def decrypt(x, k):
    key = key_schedule(k)                # получаем 32-битные ключи
    key.reverse()
    (L, R) = split(x)                    # разбиваем шифруемое выражение на две части
    for i in range(31):
        (L, R) = G(L, R, key[i])         # 31 раунд шифрации с помощью функции G
    (R, L) = G(L, R, key[31])            # Делаем последний 32 раунд, но записываем результат наоборот
    return join(L, R)


# Проверка
def main():
    encrypt_phrase = 0xfedcba9876543210         # фраза для шифрации
    result_encrypt = encrypt(encrypt_phrase, K) # результат шифрации
    control_result = 0x4ee901e5c2d8ca3d         # проверочная фраза для зашифрованной фразы
    # Проверка для шифрации
    print("ШИФРАЦИЯ")
    if (result_encrypt == control_result):
        print("УСПЕХ ШИФРАЦИИ! Результат:", hex(result_encrypt), " = ", hex(control_result))
    else:
        print("ОШИБКА ШИФРАЦИИ!!! Результат:", hex(result_encrypt), " != ", hex(control_result) )

    # Проверка для дешифрации
    result_decrypt = decrypt(result_encrypt, K) # Дешифрация
    print("ДЕШИФРАЦИЯ")
    if (result_decrypt == encrypt_phrase):
        print("УСПЕХ ДЕШИФРАЦИИ! Результат:", hex(result_decrypt),    " = ", hex(encrypt_phrase))
    else:
        print("ОШИБКА ДЕШИФРАЦИИ!!! Результат:", hex(result_decrypt), " != ", hex(encrypt_phrase) )

main()